vlm/extension/Documents/ЭтапПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АльтернативныеВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/СостоянияОбеспеченияЭтапаПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияОбеспеченияЭтапаПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбеспеченПолностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяОбеспечение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СрокСдачиЗаказчику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ДатаРасчетаСрокаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ОбщийСрокИзготовленияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_СрокИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЭтапПроизводства2_2/Forms/Диспетчирование/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ТекстЗапросаДинамическогоСпискаДиспетчированиеЭтапов")
Функция бит_ТекстЗапросаДинамическогоСпискаДиспетчированиеЭтапов()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Этапы.Статус КАК Статус,
	|	&ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	|	Этапы.Распоряжение КАК Распоряжение,
	|	Этапы.Распоряжение.Подразделение КАК ПодразделениеДиспетчер,
	|	Этапы.НаименованиеЭтапа КАК НаименованиеЭтапа,
	|	Этапы.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
	|	Этапы.Подразделение КАК Подразделение,
	|	Этапы.Спецификация КАК Спецификация,
	|	Этапы.ПартияПроизводства КАК ПартияПроизводства,
	|	Этапы.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	Этапы.НомерСледующегоЭтапа КАК НомерСледующегоЭтапа,
	|	ВЫБОР
	|		КОГДА &ПланируетсяГрафикПроизводства
	|				И ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						РегистрСведений.ЗаданияКРасчетуГрафикаПроизводства КАК Т
	|					ГДЕ
	|						НЕ Этапы.ДинамическаяСтруктура
	|						И Т.Распоряжение = Этапы.Распоряжение
	|						И Т.ЭтапПроизводства = Этапы.Ссылка
	|					
	|					ОБЪЕДИНИТЬ ВСЕ
	|					
	|					ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства КАК Т
	|					ГДЕ
	|						Этапы.ДинамическаяСтруктура
	|						И Т.ЭтапПроизводства = Этапы.Ссылка
	|					)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребуетсяПланироватьГрафик,
	|
	|	ЕСТЬNULL(СостоянияЭтаповПроизводства.СостояниеОбеспечения, &ПустаяСсылкаСостояниеОбеспечения) КАК СостояниеОбеспечения,
	|	ЕСТЬNULL(СостоянияЭтаповПроизводства.СостояниеОбеспечения, &ПустаяСсылкаСостояниеОбеспечения)
	|		= ЗНАЧЕНИЕ(Перечисление.СостоянияОбеспеченияЭтапаПроизводства.ОжидаетсяОбеспечение) КАК ОжидаетсяОбеспечение,
	|
	|	ВЫБОР
	|		КОГДА &ПланируетсяГрафикПроизводства
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикПроизводства.ОграничиваетСрокВыпуска, ЛОЖЬ) = ИСТИНА
	|						ТОГДА 3
	|					КОГДА ЕСТЬNULL(ГрафикПроизводства.НаКритическомПути, ЛОЖЬ) = ИСТИНА
	|						ТОГДА 2
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК СостояниеОграниченийВГрафике,
	|	ВЫБОР
	|		КОГДА Этапы.Статус = &СтатусЗавершен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.Завершен)
	|		ИНАЧЕ ЕСТЬNULL(СостоянияЭтаповПроизводства.СостояниеНаМежцеховомУровне, &ПустаяСсылкаСостояние)
	|	КОНЕЦ КАК СостояниеЭтапа,
	|	
	|	ЕСТЬNULL(СостоянияЭтаповПроизводства.СостояниеОпераций, &ПустаяСсылкаСостояниеОпераций) КАК СостояниеОпераций,
	|	ВЫБОР
	|		КОГДА Этапы.ТребуетсяЗаполнитьПоОперациям
	|			ТОГДА 3
	|		КОГДА СостоянияЭтаповПроизводства.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.ОжидаетНазначения)
	|			ТОГДА 0
	|		КОГДА СостоянияЭтаповПроизводства.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.ОжидаетЗавершения)
	|			ТОГДА 1
	|		КОГДА СостоянияЭтаповПроизводства.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.Выполнено)
	|			ТОГДА 2
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК КодСостоянияОпераций,
	|	Этапы.ТребуетсяЗаполнитьПоОперациям КАК ТребуетсяЗаполнитьПоОперациям,
	|	НЕ Этапы.ТребуетсяЗаполнитьПоОперациям
	|		И СостоянияЭтаповПроизводства.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.ОжидаетНазначения) КАК ТребуетсяНазначитьОперации,
	|	
	|	ВЫБОР
	|		КОГДА Этапы.ДинамическаяСтруктура ИЛИ &ПланируетсяГрафикПроизводства
	|			ТОГДА НЕ ГрафикПроизводства.Этап ЕСТЬ NULL
	|		ИНАЧЕ НЕ НормативныйГрафикПроизводства.ЭтапПроизводства ЕСТЬ NULL 
	|	КОНЕЦ КАК ГрафикРассчитан,
	|	ВЫБОР
	|		КОГДА &ПланируетсяГрафикПроизводства
	|				И НЕ ГрафикПроизводства.Этап ЕСТЬ NULL 
	|			ТОГДА НАЧАЛОПЕРИОДА(ГрафикПроизводства.Начало, ДЕНЬ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Этапы.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафикПроизводства.ДлительностьДоЗапуска, 0)), ДЕНЬ)
	|	КОНЕЦ КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА &ДатаАктуальности > ВЫБОР
	|				КОГДА &ПланируетсяГрафикПроизводства
	|						И НЕ ГрафикПроизводства.Этап ЕСТЬ NULL 
	|					ТОГДА ГрафикПроизводства.Начало
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(Этапы.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафикПроизводства.ДлительностьДоЗапуска, 0))
	|			КОНЕЦ И Этапы.Статус В (&СтатусФормируется, &СтатусСформирован, &СтатусКВыполнению)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	ВЫБОР
	|		КОГДА ГрафикПроизводства.Начало ЕСТЬ НЕ NULL
	|				И НЕ ГрафикПроизводства.Этап ЕСТЬ NULL 
	|			ТОГДА ГрафикПроизводства.Начало
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Этапы.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафикПроизводства.ДлительностьДоЗапуска, 0))
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ГрафикПроизводства.Окончание ЕСТЬ НЕ NULL
	|				И НЕ ГрафикПроизводства.Этап ЕСТЬ NULL 
	|			ТОГДА ГрафикПроизводства.Окончание
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Этапы.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафикПроизводства.ДлительностьДоЗапуска + НормативныйГрафикПроизводства.Ресурсоемкость, 0))
	|	КОНЕЦ КАК ДатаЗавершения,
	|	ВЫБОР 
	|		КОГДА ГрафикПроизводства.Начало ЕСТЬ НЕ NULL И НЕ ГрафикПроизводства.Этап ЕСТЬ NULL ТОГДА 
	|			ВЫБОР 
	|				КОГДА Этапы.Статус В (&СтатусФормируется, &СтатусСформирован, &СтатусКВыполнению) И РАЗНОСТЬДАТ(ГрафикПроизводства.Начало, &ДатаАктуальности, ДЕНЬ) > 0 ТОГДА
	|					РАЗНОСТЬДАТ(ГрафикПроизводства.Начало, &ДатаАктуальности, ДЕНЬ)
	|				КОГДА Этапы.Статус = &СтатусНачат И РАЗНОСТЬДАТ(ГрафикПроизводства.Окончание, &ДатаАктуальности, ДЕНЬ) > 0 ТОГДА
	|					РАЗНОСТЬДАТ(ГрафикПроизводства.Окончание, &ДатаАктуальности, ДЕНЬ)
	|				КОГДА Этапы.Статус = &СтатусЗавершен И РАЗНОСТЬДАТ(ГрафикПроизводства.Окончание, Этапы.ФактическоеОкончаниеЭтапа, ДЕНЬ) > 0 ТОГДА
	|					РАЗНОСТЬДАТ(ГрафикПроизводства.Окончание, Этапы.ФактическоеОкончаниеЭтапа, ДЕНЬ)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК Задержка,
	|	ВЫБОР
	|		КОГДА ГрафикПроизводства.Начало ЕСТЬ НЕ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ГрафикПроизводства.Этап ЕСТЬ NULL 
	|							И (&ДатаАктуальности > ГрафикПроизводства.Начало
	|									И Этапы.Статус В (&СтатусФормируется, &СтатусСформирован, &СтатусКВыполнению)
	|								ИЛИ &ДатаАктуальности > ГрафикПроизводства.Окончание
	|									И Этапы.Статус <> &СтатусЗавершен)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ НормативныйГрафикПроизводства.ЭтапПроизводства ЕСТЬ NULL 
	|						И (&ДатаАктуальности > ДОБАВИТЬКДАТЕ(Этапы.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафикПроизводства.ДлительностьДоЗапуска, 0))
	|								И Этапы.Статус В (&СтатусФормируется, &СтатусСформирован, &СтатусКВыполнению)
	|							ИЛИ &ДатаАктуальности > ДОБАВИТЬКДАТЕ(Этапы.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафикПроизводства.ДлительностьДоЗапуска + НормативныйГрафикПроизводства.Ресурсоемкость, 0))
	|								И Этапы.Статус <> &СтатусЗавершен)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЕстьОтставаниеОтГрафика,
	|	
	|	ВЫБОР
	|		КОГДА Этапы.РучноеРазмещениеВГрафике И &ПланируетсяГрафикПроизводства
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ДатаНачалаИндексКартинки,
	|	
	|	ВЫБОР
	|		КОГДА Этапы.РучноеРазмещениеВГрафике И &ПланируетсяГрафикПроизводства
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ДатаОкончанияИндексКартинки,
	|	
	|	Этапы.ДатаПроизводства КАК ДатаПроизводства,
	|	Этапы.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|
	|	Этапы.КоличествоУпаковокПлан     КАК КоличествоПлан,
	|	Этапы.КоличествоУпаковокФакт     КАК КоличествоФакт,
	|	Этапы.КоличествоУпаковокОтменено КАК КоличествоОтменено,
	|	ВЫБОР
	|		КОГДА Этапы.УпаковкаПлан = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА Этапы.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Этапы.УпаковкаПлан
	|	КОНЕЦ КАК КоличествоЕдиницаИзмерения,
	|
	|	0 КАК ОстатокТрудоемкости,
	|	0 КАК ПроцентВыполнения, 
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 16:35:01] +        
	|	Выбор когда Этапы.НазначениеПродукция.Заказ Ссылка Документ.ЗаказКлиента Тогда Этапы.НазначениеПродукция.Заказ.Комментарий Иначе """" Конец КАК бит_КомментарийЗаказаКлиента,
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 16:35:01] -
	#КонецВставки
	|	
	|	Этапы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Этапы
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативныйГрафикЭтаповПроизводства КАК НормативныйГрафикПроизводства
	|		ПО Этапы.Ссылка = НормативныйГрафикПроизводства.ЭтапПроизводства
	|		И Этапы.Распоряжение = НормативныйГрафикПроизводства.Распоряжение
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭтаповПроизводства КАК СостоянияЭтаповПроизводства
	|		ПО Этапы.Распоряжение = СостоянияЭтаповПроизводства.Распоряжение
	|			И Этапы.Ссылка = СостоянияЭтаповПроизводства.Этап
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикПроизводства
	|		ПО &ПланируетсяГрафикПроизводства
	|			И Этапы.Распоряжение = ГрафикПроизводства.ЗаказНаПроизводство
	|			И Этапы.Ссылка = ГрафикПроизводства.Этап
	|			И (ГрафикПроизводства.СтатусГрафика = &СтатусРабочийГрафик)
	|	
	|ГДЕ
	|	НЕ Этапы.ПометкаУдаления";

	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 16:35:30] +        
	НовыйЭлемент = Элементы.Вставить("СписокЭтаповбит_КомментарийЗаказаКлиента", Тип("ПолеФормы"), Элементы.Список, Неопределено);
	НовыйЭлемент.ПутьКДанным = "Список.бит_КомментарийЗаказаКлиента";
	НовыйЭлемент.Заголовок = "(бит) Комментарий заказа клиента";
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 16:35:30] -
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [21.04.2026] +        
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
	"Этапы.Статус КАК Статус,", 
	"Этапы.Статус КАК Статус,
	|	Этапы.бит_ЗамененНовымЭтапом КАК бит_ЗамененНовымЭтапом,");
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ЭтапыЗамененНовымЭтапом", Тип("ПолеФормы"), Элементы.Список, Элементы.ПредставлениеЭтапа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Список.бит_ЗамененНовымЭтапом";
	НовыйЭлемент.Заголовок = "(бит) Заменен новым этапом"; 
	НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.ОформлениеВосклицательныйЗнак;
	//НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Подсказка = "Заменен новым этапом";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [21.04.2026] -
	
	// {{ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [25.05.2026 18:04:30] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ЗакрытиеЭтапов");
	НоваяКоманда.Заголовок = "(бит) Закрыть этапы";
	НоваяКоманда.Действие = "бит_ЗакрытиеЭтапов"; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗакрытиеЭтапов", Тип("КнопкаФормы"), Элементы.ГруппаКоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "бит_ЗакрытиеЭтапов";
	// }}ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [25.05.2026 18:04:30] -
КонецПроцедуры  

&НаКлиенте
Процедура бит_ЗакрытиеЭтапов()
	// {{ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [25.05.2026 18:07:05] +        
	мВыделенныхСтрок = Элементы.Список.ВыделенныеСтроки;
	мДокументов = Новый Массив;
	Для каждого стр из мВыделенныхСтрок Цикл
		мДокументов.Добавить(Элементы.Список.ДанныеСтроки(стр).Ссылка);
	КонецЦикла;                                                        
	бит_ЗакрытьЭтапыНаСервере(мДокументов);  
	элементы.Список.Обновить();
	// }}ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [25.05.2026 18:07:05] -
КонецПроцедуры

&НаСервере
Процедура бит_ЗакрытьЭтапыНаСервере(Знач мДокументов)
	// {{ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [25.05.2026 18:22:11] +        
	// найдем количество произведенных:
	Для каждого текЭтап Из мДокументов Цикл
		ОбработатьЗакрытиеЭтапаНаСервере(текЭтап);
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [25.05.2026 18:22:11] -
КонецПроцедуры                 

&НаСервереБезКонтекста
Процедура ОбработатьЗакрытиеЭтапаНаСервере(Знач текЭтап)
	// {{ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [26.05.2026 11:18:18] +        
	ЭтапОбъект = текЭтап.ПолучитьОбъект();
	Для каждого стр из ЭтапОбъект.ОбеспечениеМатериаламиИРаботами Цикл
		Если стр.Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Истина
			И Не ЗначениеЗаполнено(стр.Серия) 
			И не стр.Отменено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны серии в таблице Обеспечение " + текЭтап, текЭтап);
			Возврат;
		КонецЕсли; 
		Если Не стр.Отменено Тогда
			стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоФакт = 0;           
	ПричинаОтмены = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПричинаЗаменыОборудования, , Истина);
	Для каждого стр из ЭтапОбъект.ВыходныеИзделия Цикл 
		Если стр.Отменено Тогда 
			Продолжить;
		ИначеЕсли стр.Произведено Тогда 	
			КоличествоФакт = КоличествоФакт + стр.Количество;
		Иначе
			стр.Отменено = Истина;
			стр.ПричинаОтмены = ПричинаОтмены;
		КонецЕсли;
	КонецЦикла;
	ЭтапОбъект.КоличествоУпаковокОтменено = ЭтапОбъект.КоличествоУпаковокПлан - КоличествоФакт;  
	ЭтапОбъект.ОтразитьКоличествоОтмененоВТЧ(ПричинаОтмены);
	
	// пересчитаем обеспечение
	бит_ПересчитатьОбеспечение(ЭтапОбъект);
	// вкладка расход                                                                                 
	бит_ПересчитатьРасход(ЭтапОбъект);
	
	ЭтапОбъект.ДатаПроизводства = КонецДня(ТекущаяДатаСеанса());
	ЭтапОбъект.ФактическоеОкончаниеЭтапа = КонецДня(ТекущаяДатаСеанса());
	
	бит_ЗаписатьЭтап(ЭтапОбъект);

	// }}ПервыйБИТ ЛистТребований [Доработка закрытия этапов]  [VUVaynula@1cbit.ru] [26.05.2026 11:18:18] -
КонецПроцедуры

&НаСервереБезКонтекста
Процедура бит_ПересчитатьОбеспечение(Знач ЭтапОбъект)
	
	Всего = 0;
	Для Каждого стр из ЭтапОбъект.ВыходныеИзделия Цикл
		Если стр.Отменено Тогда
			Продолжить;
		КонецЕсли;
		Всего = Всего + стр.Количество; 
	КонецЦикла;      
	
	Спецификация = ЭтапОбъект.Спецификация; 
	Если Спецификация.ОсновноеИзделиеУпаковка.Знаменатель = 0 Тогда
		КоэфУпакРС = 1;
	Иначе
		КоэфУпакРС = Спецификация.ОсновноеИзделиеУпаковка.Числитель / Спецификация.ОсновноеИзделиеУпаковка.Знаменатель;
	КонецЕсли;
	КоэфРС = Спецификация.ОсновноеИзделиеКоличествоУпаковок * КоэфУпакРС;  
	Если КоэфРС = 0 Тогда 
		КоэфРС = 1;
	КонецЕсли;	
	
	тзОбеспечениеИзСпецификации = ЭтапОбъект.Спецификация.МатериалыИУслуги.Выгрузить();
	Для каждого стрОбеспечениеЭтапа из ЭтапОбъект.ОбеспечениеМатериаламиИРаботами Цикл
		// не берем отмененные и те где пользователь сам указал серию а значит и количество)
		Если стрОбеспечениеЭтапа.Отменено 
			или ЗначениеЗаполнено(стрОбеспечениеЭтапа.Серия) Тогда
			Продолжить;
		КонецЕсли;
		
		мСтрокСпецификации = тзОбеспечениеИзСпецификации.НайтиСтроки(Новый Структура("Номенклатура, КлючСвязи", стрОбеспечениеЭтапа.Номенклатура, стрОбеспечениеЭтапа.КлючСвязиСпецификация));
		Если мСтрокСпецификации.Количество() Тогда
			новКоличество = Всего * мСтрокСпецификации[0].КоличествоУпаковок / КоэфРС;
			
			стрОбеспечениеЭтапа.Количество = новКоличество;
			стрОбеспечениеЭтапа.КоличествоУпаковок = новКоличество;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура бит_ЗаписатьЭтап(Знач ЭтапОбъект)
	
	Попытка     
		ЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
		ЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение  
		//ЭтапОбъект.Статус = ЭтапОбъект.Ссылка.Статус;
		//ЭтапОбъект.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ " +ЭтапОбъект.Ссылка + " по причине " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ЭтапОбъект.Ссылка);
	КонецПопытки;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура бит_ПересчитатьРасход(ЭтапОбъект)
	
	Режим = 0;
	Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(ЭтапОбъект, Режим);
	// взята с формы
	ПослеИзмененияСтрокТЧПрограммноНаСервере_РасходМатериаловИРабот(ЭтапОбъект, "РасходМатериаловИРабот");

КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ПослеИзмененияСтрокТЧПрограммноНаСервере_РасходМатериаловИРабот(ЭтапОбъект, ИмяТЧ, МассивИдентификаторовСтрок = Неопределено, СтруктураРанееВыполненныхДействий = Неопределено)
	// {{ПервыйБИТ ЛистТребований [Доработка закрытия заказов]  [VUVaynula@1cbit.ru] [26.05.2026 11:56:42] +        
	МассивСтрок = Неопределено;
	КоллекцияСтрок = ЭтапОбъект[ИмяТЧ]; // ДанныеФормыКоллекция
	//Если МассивИдентификаторовСтрок <> Неопределено Тогда
	//	МассивСтрок = Новый Массив;
	//	Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
	//		МассивСтрок.Добавить(ЭтапОбъект[ИмяТЧ].НайтиПоИдентификатору(ИдентификаторСтроки));
	//	КонецЦикла; 
	//	КоллекцияСтрок = МассивСтрок; // Массив из ДанныеФормыЭлементКоллекции
	//КонецЕсли;
	
	//Если СтруктураРанееВыполненныхДействий = Неопределено Тогда
		СтруктураРанееВыполненныхДействий = Новый Структура;
	//КонецЕсли;
	
	ПодразделениеИзменено = Ложь; 
	
	Если ИмяТЧ = "РасходМатериаловИРабот" Тогда
		Для каждого ТекущиеДанные Из КоллекцияСтрок Цикл
			
			Если ЭтапОбъект.РасходОднойДатой И ЭтапОбъект.ДатаРасхода <> '000101010000' Тогда
				ТекущиеДанные.ДатаРасхода = ЭтапОбъект.ДатаРасхода;
			КонецЕсли;
			
			Если ТекущиеДанные.Подразделение <> ЭтапОбъект.Подразделение Тогда
				ТекущиеДанные.Подразделение = ЭтапОбъект.Подразделение;
				ПодразделениеИзменено = Истина;
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;
	
	Если (НЕ СтруктураРанееВыполненныхДействий.Свойство("ПроверитьСериюРассчитатьСтатус")
			ИЛИ ПодразделениеИзменено) Тогда
		ЗаполнитьСтатусыУказанияСерийСервер(ЭтапОбъект, ИмяТЧ);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [Доработка закрытия заказов]  [VUVaynula@1cbit.ru] [26.05.2026 11:56:42] -
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура ЗаполнитьСтатусыУказанияСерийСервер(ЭтапОбъект, СписокТЧ = Неопределено)
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ЭтапОбъект, Документы.ЭтапПроизводства2_2));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтапОбъект, ПараметрыУказанияСерий.РасходМатериаловИРабот);
	
КонецПроцедуры
